Revit 2027 API
BuiltInFailures.HvacFailures.PanelDoesntMatchCircuitPropertiesDisconnected Property
 The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelDoesntMatchCircuitPropertiesDisconnected { get; }
Public Shared ReadOnly Property PanelDoesntMatchCircuitPropertiesDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelDoesntMatchCircuitPropertiesDisconnected {
	FailureDefinitionId^ get ();
}
static member PanelDoesntMatchCircuitPropertiesDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HvacFailures Class
Autodesk.Revit.DB Namespace